[
	{
		"id": "http://zotero.org/users/5856333/items/B897EGM4",
		"type": "article-journal",
		"abstract": "We investigate the challenging task of learning causal structure in the presence of latent variables, including locating latent variables, determining their quantity, and identifying causal relationships among both latent and observed variables. To address this, we propose a Generalized Independent Noise (GIN) condition for linear non-Gaussian acyclic causal models that incorporate latent variables, which establishes the independence between a linear combination of certain measured variables and some other measured variables. Specifically, for two observed random vectors YY\\bf{Y} and ZZ\\bf{Z}, GIN holds if and only if ω⊺Yω⊺Y\\omega^{\\intercal}\\mathbf{Y} and ZZ\\mathbf{Z} are statistically independent, where ωω\\omega is a non-zero parameter vector determined by the cross-covariance between YY\\mathbf{Y} and ZZ\\mathbf{Z}. We then give necessary and sufficient graphical criteria of the GIN condition in linear non-Gaussian acyclic causal models. From a graphical perspective, roughly speaking, GIN implies the existence of a set S\\mathcal{S} such that S\\mathcal{S} is causally earlier (w.r.t. the causal ordering) than YY\\mathbf{Y}, and that every active (collider-free) path between YY\\mathbf{Y} and ZZ\\mathbf{Z} must contain a node from S\\mathcal{S}. Interestingly, we find that the independent noise condition (i.e., if there is no confounder, causes are independent of the residual derived from regressing the effect on the causes) can be seen as a special case of GIN. With such a connection between GIN and latent causal structures,  we further leverage the proposed GIN condition, together with a well-designed search procedure, to efficiently estimate Linear, Non-Gaussian Latent Hierarchical Models (LiNGLaHs), where latent confounders may also be causally related and may even follow a hierarchical structure.  We show that the underlying causal structure of a LiNGLaH is identifiable in light of GIN conditions under mild assumptions. Experimental results on both synthetic and three real-world data sets show the effectiveness of the proposed approach.",
		"container-title": "Journal of Machine Learning Research",
		"ISSN": "1533-7928",
		"issue": "191",
		"page": "1-61",
		"source": "www.jmlr.org",
		"title": "Generalized Independent Noise Condition for Estimating Causal Structure with Latent Variables",
		"URL": "http://jmlr.org/papers/v25/23-1052.html",
		"volume": "25",
		"author": [
			{
				"family": "Xie",
				"given": "Feng"
			},
			{
				"family": "Huang",
				"given": "Biwei"
			},
			{
				"family": "Chen",
				"given": "Zhengming"
			},
			{
				"family": "Cai",
				"given": "Ruichu"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			},
			{
				"family": "Geng",
				"given": "Zhi"
			},
			{
				"family": "Zhang",
				"given": "Kun"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2024"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/BNNMMF42",
		"type": "article-journal",
		"abstract": "In an essay recently published in this journal, Branden Fitelson argues that a variant of Miller's argument for the language dependence of the accuracy of predictions can be applied to Joyce's notion of accuracy of credences formulated in terms of scoring rules, resulting in a general potential problem for Joyce's argument for probabilism. We argue that no relevant problem of the sort Fitelson supposes arises since his main theorem and his supporting arguments presuppose the validity of nonlinear transformations of credence functions that Joyce's theory, charitably construed, would identify as invalid on the basis of the principle of simple dominance.",
		"container-title": "Philosophy of Science",
		"DOI": "10.1086/667997",
		"ISSN": "0031-8248, 1539-767X",
		"issue": "4",
		"language": "en",
		"page": "561-574",
		"source": "Cambridge University Press",
		"title": "What Language Dependence Problem? A Reply for Joyce to Fitelson on Joyce",
		"title-short": "What Language Dependence Problem?",
		"URL": "https://www.cambridge.org/core/journals/philosophy-of-science/article/what-language-dependence-problem-a-reply-for-joyce-to-fitelson-on-joyce/31B3C59CF9F5AC47F028D8D77F540416",
		"volume": "79",
		"author": [
			{
				"family": "Pedersen",
				"given": "Arthur Paul"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2012",
					10
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/Q3Y59QTX",
		"type": "article-journal",
		"abstract": "Halvorson argues through a series of examples and a general result due to Myers that the “semantic view” of theories has no available account of formal theoretical equivalence. De Bouvere provides criteria overlooked in Halvorson’s paper that are immune to his counterexamples and to the theorem he cites. Those criteria accord with a modest version of the semantic view that rejects some of Van Fraassen’s apparent claims while retaining the core of Patrick Suppes’s proposal. I do not endorse any version of the semantic view of theories.",
		"container-title": "Philosophy of Science",
		"DOI": "10.1086/670261",
		"ISSN": "0031-8248, 1539-767X",
		"issue": "2",
		"language": "en",
		"page": "286-297",
		"source": "Cambridge University Press",
		"title": "Theoretical Equivalence and the Semantic View of Theories",
		"URL": "https://www.cambridge.org/core/journals/philosophy-of-science/article/theoretical-equivalence-and-the-semantic-view-of-theories/B0A0E27EFCBAEB2B46886914F422074A",
		"volume": "80",
		"author": [
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2013",
					4
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/RBX9LZDI",
		"type": "article-journal",
		"abstract": "Reverse inference in cognitive neuropsychology has been characterized as inference to ‘psychological processes’ from ‘patterns of activation’ revealed by functional magnetic resonance or other scanning techniques. Several arguments have been provided against the possibility. Focusing on Machery’s ([2014]) presentation, we attempt to clarify the issues, rebut the impossibility arguments, and propose and illustrate a strategy for reverse inference.",
		"container-title": "The British Journal for the Philosophy of Science",
		"DOI": "10.1093/bjps/axv019",
		"ISSN": "0007-0882",
		"issue": "4",
		"note": "publisher: The University of Chicago Press",
		"page": "1139-1153",
		"source": "journals.uchicago.edu (Atypon)",
		"title": "Reverse Inference in Neuropsychology",
		"URL": "https://www.journals.uchicago.edu/doi/full/10.1093/bjps/axv019",
		"volume": "67",
		"author": [
			{
				"family": "Glymour",
				"given": "Clark"
			},
			{
				"family": "Hanson",
				"given": "Catherine"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2016",
					12
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/M29KQWLU",
		"type": "article-journal",
		"abstract": "Smith et al. report a large study of the accuracy of 38 search procedures for recovering effective connections in simulations of DCM models under 28 different conditions. Their results are disappointing: no method reliably finds and directs connections without large false negatives, large false positives, or both. Using multiple subject inputs, we apply a previously published search algorithm, IMaGES, and novel orientation algorithms, LOFS, in tandem to all of the simulations of DCM models described by Smith et al. (2011). We find that the procedures accurately identify effective connections in almost all of the conditions that Smith et al. simulated and, in most conditions, direct causal connections with precision greater than 90% and recall greater than 80%.",
		"container-title": "NeuroImage",
		"DOI": "10.1016/j.neuroimage.2011.06.068",
		"ISSN": "1053-8119",
		"issue": "3",
		"journalAbbreviation": "NeuroImage",
		"page": "838-848",
		"source": "ScienceDirect",
		"title": "Multi-subject search correctly identifies causal connections and most causal directions in the DCM models of the Smith et al. simulation study",
		"URL": "https://www.sciencedirect.com/science/article/pii/S1053811911007142",
		"volume": "58",
		"author": [
			{
				"family": "Ramsey",
				"given": "Joseph D."
			},
			{
				"family": "Hanson",
				"given": "Stephen José"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2011",
					10,
					1
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/UL2HU9WM",
		"type": "article-journal",
		"abstract": "We consider several alternative ways of exploiting non-Gaussian distributional features, including some that can in principle identify direct, positive feedback relations (graphically, 2-cycles) and combinations of methods that can identify high dimensional graphs. All of the procedures are implemented in the TETRAD freeware (Ramsey et al., 2013). We show that in most cases the limited accuracy of the several non-Gaussian methods in the Smith et al. (2011) simulations can be attributed to the high-pass Butterworth filter used in that study. Without that filter, or with the filter in the widely used FSL program (Jenkinson et al., 2012), the directional accuracies of several of the non-Gaussian methods are at or near ceiling in many conditions of the Smith et al. simulation. We show that the improvement of an apparently Gaussian method (Patel et al., 2006) when filtering is removed is due to non-Gaussian features of that method introduced by the Smith et al. implementation. We also investigate some conditions in which multi-subject data help with causal structure identification using higher moments, notably with non-stationary time series or with 2-cycles. We illustrate the accuracy of the methods with more complex graphs with and without 2-cycles, and with a 500 node graph; to illustrate applicability and provide a further test we apply the methods to an empirical case for which aspects of the causal structure are known. Finally, we note a number of cautions and issues that remain to be investigated, and some outstanding problems for determining the structure of effective connections from fMRI data.",
		"container-title": "NeuroImage",
		"DOI": "10.1016/j.neuroimage.2013.09.062",
		"ISSN": "1053-8119",
		"journalAbbreviation": "NeuroImage",
		"page": "986-1006",
		"source": "ScienceDirect",
		"title": "Non-Gaussian methods and high-pass filters in the estimation of effective connections",
		"URL": "https://www.sciencedirect.com/science/article/pii/S1053811913009981",
		"volume": "84",
		"author": [
			{
				"family": "Ramsey",
				"given": "Joseph D."
			},
			{
				"family": "Sanchez-Romero",
				"given": "Ruben"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2014",
					1,
					1
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/K6SPJKYN",
		"type": "article-journal",
		"abstract": "Recent literature in philosophy of science has addressed purported notions of explanatory virtues—‘explanatory power’, ‘unification’, and ‘coherence’. In each case, a probabilistic relation between a theory and data is said to measure the power of an explanation, or degree of unification, or degree of coherence. This essay argues that the measures do not capture cases that are paradigms of scientific explanation, that the available psychological evidence indicates that the measures do not capture judgements of explanatory power, and, finally, that the measures do not provide useful methods for selecting hypotheses.",
		"container-title": "The British Journal for the Philosophy of Science",
		"DOI": "10.1093/bjps/axt051",
		"ISSN": "0007-0882",
		"issue": "3",
		"note": "publisher: The University of Chicago Press",
		"page": "591-604",
		"source": "journals.uchicago.edu (Atypon)",
		"title": "Probability and the Explanatory Virtues",
		"URL": "https://www.journals.uchicago.edu/doi/full/10.1093/bjps/axt051",
		"volume": "66",
		"author": [
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2015",
					9
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/AG3ZXXN3",
		"type": "article-journal",
		"abstract": "Neumann et al. (2010) aim to find directed graphical representations of the independence and dependence relations among activities in brain regions by applying a search procedure to merged fMRI activity records from a large number of contrasts obtained under a variety of conditions. To that end, Neumann et al., obtain three graphical models, justifying their search procedure with simulations that find that merging the data sampled from probability distributions characterized by two distinct Bayes net graphs results in a graphical object that combines the edges in the individual graphs. We argue that the graphical objects they obtain cannot be interpreted as representations of conditional independence and dependence relations among localized neural activities; specifically, directed edges and directed pathways in their graphical results may be artifacts of the manner in which separate studies are combined in the meta-analytic procedure. With a larger simulation study, we argue that their simulation results with combined data sets are an artifact of their choice of examples. We provide sufficient conditions and necessary conditions for the merger of two or more probability distributions, each characterized by the Markov equivalence class of a directed acyclic graph, to be describable by a Markov equivalence class whose edges are a union of those for the individual distributions. Contrary to Neumann et al., we argue that the scientific value of searches for network representations from imaging data lies in attempting to characterize large scaled neural mechanisms, and we suggest several alternative strategies for combining data from multiple experiments.",
		"container-title": "NeuroImage",
		"DOI": "10.1016/j.neuroimage.2010.07.065",
		"ISSN": "1053-8119",
		"issue": "2",
		"journalAbbreviation": "NeuroImage",
		"page": "323-330",
		"source": "ScienceDirect",
		"title": "On meta-analyses of imaging data and the mixture of records",
		"URL": "https://www.sciencedirect.com/science/article/pii/S1053811910010578",
		"volume": "57",
		"author": [
			{
				"family": "Ramsey",
				"given": "J. D."
			},
			{
				"family": "Spirtes",
				"given": "P."
			},
			{
				"family": "Glymour",
				"given": "C."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2011",
					7,
					15
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/4CV6ZKRN",
		"type": "paper-conference",
		"abstract": "In many domains, data are distributed among datasets that share only some variables; other recorded variables may occur in only one dataset. There are several asymptotically correct, informative algorithms that search for causal information given a single dataset, even with missing values and hidden variables. There are, however, no such reliable procedures for distributed data with overlapping variables, and only a single heuristic procedure (Structural EM). This paper describes an asymptotically correct procedure, ION, that provides all the information about structure obtainable from the marginal independence relations. Using simulated and real data, the accuracy of ION is compared with that of Structural EM, and with inference on complete, unified data.",
		"container-title": "Advances in Neural Information Processing Systems",
		"publisher": "Curran Associates, Inc.",
		"source": "Neural Information Processing Systems",
		"title": "Integrating Locally Learned Causal Structures with Overlapping Variables",
		"URL": "https://proceedings.neurips.cc/paper/2008/hash/37bc2f75bf1bcfe8450a1a41c200364c-Abstract.html",
		"volume": "21",
		"author": [
			{
				"family": "Danks",
				"given": "David"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			},
			{
				"family": "Tillman",
				"given": "Robert"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2008"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/6FCU2ATU",
		"type": "article-journal",
		"abstract": "Pointwise consistent, feasible procedures for estimating\ncontemporaneous linear causal structure from time series data have\nbeen developed using multiple conditional independence tests, but no\nsuch procedures are available for non-linear systems.  We describe a\nfeasible procedure for learning a class of non-linear time series\nstructures, which we call additive non-linear time series. We show\nthat for data generated from stationary models of this type, two\nclasses of conditional independence relations among time series\nvariables and their lags can be tested efficiently and consistently\nusing tests based on additive model regression. Combining results of\nstatistical tests for these two classes of conditional independence\nrelations and the temporal structure of time series data, a new\nconsistent model specification procedure is able to extract relatively\ndetailed causal information. We investigate the finite sample behavior\nof the procedure through simulation, and illustrate the application of\nthis method through analysis of the possible causal connections among\nfour ocean indices. Several variants of the procedure are also\ndiscussed.",
		"container-title": "Journal of Machine Learning Research",
		"ISSN": "1533-7928",
		"issue": "32",
		"page": "967-991",
		"source": "www.jmlr.org",
		"title": "Search for Additive Nonlinear Time Series Causal Models",
		"URL": "http://jmlr.org/papers/v9/chu08a.html",
		"volume": "9",
		"author": [
			{
				"family": "Chu",
				"given": "Tianjiao"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2008"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/G6W7YPLM",
		"type": "chapter",
		"abstract": "By combining experimental interventions with search procedures for graphical causal models we show that under familiar assumptions, with perfect data, N - 1 experiments suffice to determine the causal relations among N>2 variables when each experiment randomizes at most one variable. We show the same bound holds for adaptive learners, but does not hold for N > 4 when each experiment can simultaneously randomize more than one variable. This bound provides a type of ideal for the measure of success of heuristic approaches in active learning methods of causal discovery, which currently use less informative measures.",
		"container-title": "Innovations in Machine Learning: Theory and Applications",
		"event-place": "Berlin, Heidelberg",
		"ISBN": "978-3-540-33486-6",
		"language": "en",
		"note": "DOI: 10.1007/3-540-33486-6_4",
		"page": "97-112",
		"publisher": "Springer",
		"publisher-place": "Berlin, Heidelberg",
		"source": "Springer Link",
		"title": "N-1 Experiments Suffice to Determine the Causal Relations Among N Variables",
		"URL": "https://doi.org/10.1007/3-540-33486-6_4",
		"author": [
			{
				"family": "Eberhardt",
				"given": "Frederick"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			},
			{
				"family": "Scheines",
				"given": "Richard"
			}
		],
		"editor": [
			{
				"family": "Holmes",
				"given": "Dawn E."
			},
			{
				"family": "Jain",
				"given": "Lakhmi C."
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2006"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/SWC7RG9Z",
		"type": "article-journal",
		"container-title": "Commun. ACM",
		"DOI": "10.1145/240455.240466",
		"ISSN": "0001-0782",
		"issue": "11",
		"page": "35–41",
		"source": "ACM Digital Library",
		"title": "Statistical inference and data mining",
		"URL": "https://dl.acm.org/doi/10.1145/240455.240466",
		"volume": "39",
		"author": [
			{
				"family": "Glymour",
				"given": "Clark"
			},
			{
				"family": "Madigan",
				"given": "David"
			},
			{
				"family": "Pregibon",
				"given": "Daryl"
			},
			{
				"family": "Smyth",
				"given": "Padhraic"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"1996",
					11,
					1
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/UCT62YEJ",
		"type": "chapter",
		"container-title": "Qualitative Simulation Modeling and Analysis",
		"event-place": "New York, NY",
		"ISBN": "978-0-387-97400-2",
		"note": "collection-title: Advances in Simulation\nDOI: 10.1007/978-1-4613-9072-5_4",
		"page": "72-97",
		"publisher": "Springer New York",
		"publisher-place": "New York, NY",
		"source": "DOI.org (Crossref)",
		"title": "A Qualitative Approach to Causal Modeling",
		"URL": "http://link.springer.com/10.1007/978-1-4613-9072-5_4",
		"volume": "5",
		"collection-editor": [
			{
				"family": "Luker",
				"given": "Paul A."
			},
			{
				"family": "Schmidt",
				"given": "Bernd"
			}
		],
		"editor": [
			{
				"family": "Fishwick",
				"given": "Paul A."
			},
			{
				"family": "Luker",
				"given": "Paul A."
			}
		],
		"author": [
			{
				"family": "Scheines",
				"given": "Richard"
			},
			{
				"family": "Spirtes",
				"given": "Peter"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"1991"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/EM4UYKML",
		"type": "article-journal",
		"container-title": "Journal of the American Statistical Association",
		"DOI": "10.2307/2289067",
		"ISSN": "0162-1459",
		"issue": "396",
		"note": "publisher: [American Statistical Association, Taylor & Francis, Ltd.]",
		"page": "964-966",
		"source": "JSTOR",
		"title": "Statistics and Causal Inference: Comment: Statistics and Metaphysics",
		"title-short": "Statistics and Causal Inference",
		"URL": "https://www.jstor.org/stable/2289067",
		"volume": "81",
		"author": [
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"1986"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/QAT5D7QY",
		"type": "article-journal",
		"container-title": "Artificial Intelligence",
		"DOI": "10.1016/0004-3702(85)90043-8",
		"ISSN": "0004-3702",
		"issue": "1",
		"journalAbbreviation": "Artificial Intelligence",
		"page": "95-99",
		"source": "ScienceDirect",
		"title": "Independence assumptions and Bayesian updating",
		"URL": "https://www.sciencedirect.com/science/article/pii/0004370285900438",
		"volume": "25",
		"author": [
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"1985",
					1,
					1
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/8NPPV58P",
		"type": "article-journal",
		"abstract": "Previous asymptotically correct algorithms for recovering causal structure from sample probabilities have been limited even in sparse causal graphs to a few variables. We describe an asymptotically correct algorithm whose complexity for fixed graph connectivity increases polynomially in the number of vertices, and may in practice recover sparse graphs with several hundred variables. From sample data with n = 20,000, an implementation of the algorithm on a DECStation 3100 recovers the edges in a linear version of the ALARM network with 37 vertices and 46 edges. Fewer than 8% of the undirected edges are incorrectly identified in the output. Without prior ordering information, the program also determines the direction of edges for the ALARM graph with an error rate of 14%. Processing time is less than 10 seconds. Keywords DAGS, Causal Modelling.",
		"container-title": "Social Science Computer Review",
		"DOI": "10.1177/089443939100900106",
		"ISSN": "0894-4393",
		"issue": "1",
		"language": "EN",
		"note": "publisher: SAGE Publications Inc",
		"page": "62-72",
		"source": "SAGE Journals",
		"title": "An Algorithm for Fast Recovery of Sparse Causal Graphs",
		"URL": "https://doi.org/10.1177/089443939100900106",
		"volume": "9",
		"author": [
			{
				"family": "Spirtes",
				"given": "Peter"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"1991",
					4,
					1
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/T3RZSSPS",
		"type": "article-journal",
		"container-title": "Biometrika",
		"DOI": "10.1093/biomet/82.4.690",
		"ISSN": "0006-3444",
		"issue": "4",
		"journalAbbreviation": "Biometrika",
		"page": "690-692",
		"source": "Silverchair",
		"title": "Causal diagrams for empirical research: Discussion of ‘Causal diagrams for empirical research’ by J. Pearl",
		"title-short": "Causal diagrams for empirical research",
		"URL": "https://doi.org/10.1093/biomet/82.4.690",
		"volume": "82",
		"author": [
			{
				"family": "FIENBERG",
				"given": "STEPHEN E."
			},
			{
				"family": "GLYMOUR",
				"given": "CLARK"
			},
			{
				"family": "SPIRTES",
				"given": "PETER"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"1995",
					12,
					1
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/WWHNQABQ",
		"type": "paper-conference",
		"container-title": "Proceedings of the International Machine Learning Workshop, ed. R. Michalski",
		"page": "96–98",
		"source": "Google Scholar",
		"title": "Two programs for testing hypotheses of any logical form",
		"author": [
			{
				"family": "Glymour",
				"given": "Clark"
			},
			{
				"family": "Kelly",
				"given": "Kevin"
			},
			{
				"family": "Scheines",
				"given": "Richard"
			}
		],
		"issued": {
			"date-parts": [
				[
					"1983"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/YESWHDZ8",
		"type": "article-journal",
		"abstract": "We test the adequacies of several proposed and two new statistical methods for recovering the causal structure of systems with feedback from synthetic BOLD time series. We compare an adaptation of the first correct method for recovering cyclic linear systems; Granger causal regression; a multivariate autoregressive model with a permutation test; the Group Iterative Multiple Model Estimation (GIMME) algorithm; the Ramsey et al. non-Gaussian methods; two non-Gaussian methods by Hyvärinen and Smith; a method due to Patel et al.; and the GlobalMIT algorithm. We introduce and also compare two new methods, Fast Adjacency Skewness (FASK) and Two-Step, both of which exploit non-Gaussian features of the BOLD signal. We give theoretical justifications for the latter two algorithms. Our test models include feedback structures with and without direct feedback (2-cycles), excitatory and inhibitory feedback, models using experimentally determined structural connectivities of macaques, and empirical human resting-state and task data. We find that averaged over all of our simulations, including those with 2-cycles, several of these methods have a better than 80% orientation precision (i.e., the probability of a directed edge is in the true structure given that a procedure estimates it to be so) and the two new methods also have better than 80% recall (probability of recovering an orientation in the true structure).",
		"container-title": "Network Neuroscience",
		"DOI": "10.1162/netn_a_00061",
		"ISSN": "2472-1751",
		"issue": "2",
		"journalAbbreviation": "Network Neuroscience",
		"page": "274-306",
		"source": "Silverchair",
		"title": "Estimating feedforward and feedback effective connections from fMRI time series: Assessments of statistical methods",
		"title-short": "Estimating feedforward and feedback effective connections from fMRI time series",
		"URL": "https://doi.org/10.1162/netn_a_00061",
		"volume": "3",
		"author": [
			{
				"family": "Sanchez-Romero",
				"given": "Ruben"
			},
			{
				"family": "Ramsey",
				"given": "Joseph D."
			},
			{
				"family": "Zhang",
				"given": "Kun"
			},
			{
				"family": "Glymour",
				"given": "Madelyn R. K."
			},
			{
				"family": "Huang",
				"given": "Biwei"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2019",
					2,
					1
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/733AMAQU",
		"type": "article-journal",
		"abstract": "It is commonplace to encounter heterogeneous or nonstationary data, of which the underlying generating process changes across domains or over time. Such a distribution shift feature presents both challenges and opportunities for causal discovery. In this paper, we develop a framework for causal discovery from such data, called Constraint-based causal Discovery from heterogeneous/NOnstationary Data (CD-NOD), to find causal skeleton and directions and estimate the properties of mechanism changes. First, we propose an enhanced constraint-based procedure to detect variables whose local mechanisms change and recover the skeleton of the causal structure over observed variables. Second, we present a method to determine causal orientations by making use of independent changes in the data distribution implied by the underlying causal model, benefiting from information carried by changing distributions. After learning the causal structure, next, we investigate how to efficiently estimate the “driving force” of the nonstationarity of a causal mechanism. That is, we aim to extract from data a low-dimensional representation of changes. The proposed methods are nonparametric, with no hard restrictions on data distributions and causal mechanisms, and do not rely on window segmentation. Furthermore, we find that data heterogeneity benefits causal structure identification even with particular types of confounders. Finally, we show the connection between heterogeneity/nonstationarity and soft intervention in causal discovery. Experimental results on various synthetic and real-world data sets (task-fMRI and stock market data) are presented to demonstrate the efficacy of the proposed methods.",
		"container-title": "Journal of Machine Learning Research",
		"ISSN": "1533-7928",
		"issue": "89",
		"page": "1-53",
		"source": "www.jmlr.org",
		"title": "Causal Discovery from Heterogeneous/Nonstationary Data",
		"URL": "http://jmlr.org/papers/v21/19-232.html",
		"volume": "21",
		"author": [
			{
				"family": "Huang",
				"given": "Biwei"
			},
			{
				"family": "Zhang",
				"given": "Kun"
			},
			{
				"family": "Zhang",
				"given": "Jiji"
			},
			{
				"family": "Ramsey",
				"given": "Joseph"
			},
			{
				"family": "Sanchez-Romero",
				"given": "Ruben"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			},
			{
				"family": "Schölkopf",
				"given": "Bernhard"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2020"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/9VQG5XJN",
		"type": "paper-conference",
		"abstract": "Discovery of causal relationships from observational data is a fundamental problem. Roughly speaking, there are two types of methods for causal discovery, constraint-based ones and score-based ones. Score-based methods avoid the multiple testing problem and enjoy certain advantages compared to constraint-based ones. However, most of them need strong assumptions on the functional forms of causal mechanisms, as well as on data distributions, which limit their applicability. In practice the precise information of the underlying model class is usually unknown. If the above assumptions are violated, both spurious and missing edges may result. In this paper, we introduce generalized score functions for causal discovery based on the characterization of general (conditional) independence relationships between random variables, without assuming particular model classes. In particular, we exploit regression in RKHS to capture the dependence in a nonparametric way. The resulting causal discovery approach produces asymptotically correct results in rather general cases, which may have nonlinear causal mechanisms, a wide class of data distributions, mixed continuous and discrete data, and multidimensional variables. Experimental results on both synthetic and real-world data demonstrate the efficacy of our proposed approach.",
		"collection-title": "KDD '18",
		"container-title": "Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining",
		"DOI": "10.1145/3219819.3220104",
		"event-place": "New York, NY, USA",
		"ISBN": "978-1-4503-5552-0",
		"page": "1551–1560",
		"publisher": "Association for Computing Machinery",
		"publisher-place": "New York, NY, USA",
		"source": "ACM Digital Library",
		"title": "Generalized Score Functions for Causal Discovery",
		"URL": "https://dl.acm.org/doi/10.1145/3219819.3220104",
		"author": [
			{
				"family": "Huang",
				"given": "Biwei"
			},
			{
				"family": "Zhang",
				"given": "Kun"
			},
			{
				"family": "Lin",
				"given": "Yizhu"
			},
			{
				"family": "Schölkopf",
				"given": "Bernhard"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2018",
					7,
					19
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/6EHZ59UD",
		"type": "article-journal",
		"abstract": "Electronic proceedings of IJCAI 2017",
		"page": "1347-1353",
		"source": "www.ijcai.org",
		"title": "Causal Discovery from Nonstationary/Heterogeneous Data: Skeleton Estimation and Orientation Determination",
		"title-short": "Causal Discovery from Nonstationary/Heterogeneous Data",
		"URL": "https://www.ijcai.org/proceedings/2017/187",
		"author": [
			{
				"family": "Zhang",
				"given": "Kun"
			},
			{
				"family": "Huang",
				"given": "Biwei"
			},
			{
				"family": "Zhang",
				"given": "Jiji"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			},
			{
				"family": "Schölkopf",
				"given": "Bernhard"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2017"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/M7HBRZZS",
		"type": "paper-conference",
		"container-title": "Advances in Neural Information Processing Systems",
		"page": "14891–14902",
		"publisher": "Curran Associates, Inc.",
		"source": "Neural Information Processing Systems",
		"title": "Generalized Independent Noise Condition for Estimating Latent Variable Causal Graphs",
		"URL": "https://proceedings.neurips.cc/paper/2020/hash/aa475604668730af60a0a87cc92604da-Abstract.html",
		"volume": "33",
		"author": [
			{
				"family": "Xie",
				"given": "Feng"
			},
			{
				"family": "Cai",
				"given": "Ruichu"
			},
			{
				"family": "Huang",
				"given": "Biwei"
			},
			{
				"family": "Glymour",
				"given": "Clark"
			},
			{
				"family": "Hao",
				"given": "Zhifeng"
			},
			{
				"family": "Zhang",
				"given": "Kun"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2020"
				]
			]
		}
	},
	{
		"id": "http://zotero.org/users/5856333/items/H3RFJJLY",
		"type": "paper-conference",
		"container-title": "8th international workshop on climate informatics",
		"page": "1–4",
		"publisher": "National Center for Atmospheric Research",
		"source": "Google Scholar",
		"title": "Tetrad—a toolbox for causal discovery",
		"URL": "https://www.atmos.colostate.edu/~iebert/PAPERS/CI2018_paper_35.pdf",
		"author": [
			{
				"family": "Ramsey",
				"given": "Joseph D."
			},
			{
				"family": "Zhang",
				"given": "Kun"
			},
			{
				"family": "Glymour",
				"given": "Madelyn"
			},
			{
				"family": "Romero",
				"given": "Ruben Sanchez"
			},
			{
				"family": "Huang",
				"given": "Biwei"
			},
			{
				"family": "Ebert-Uphoff",
				"given": "Imme"
			},
			{
				"family": "Samarasinghe",
				"given": "Savini"
			},
			{
				"family": "Barnes",
				"given": "Elizabeth A."
			},
			{
				"family": "Glymour",
				"given": "Clark"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2025",
					9,
					17
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2018"
				]
			]
		}
	}
]